app/controllers/dogs_controller.rb

    def set_dog
      @dog = Dog.find(params[:id])
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]