app/controllers/dogs_controller.rb

  def index
    @dogs = Dog.all
---
SELECT "dogs".* FROM "dogs"

  def update
    respond_to do |format|
      if @dog.update(dog_params)
---
UPDATE "dogs" SET "name" = $1, "updated_at" = $2 WHERE "dogs"."id" = $3  [["name", "Lolaц"], ["updated_at", "2021-11-12 11:25:16.867607"], ["id", 1]]

  def destroy
    @dog.destroy
---
DELETE FROM "dogs" WHERE "dogs"."id" = $1  [["id", 1]]

    def set_dog
      @dog = Dog.find(params[:id])
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]